madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
}

}




static void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{

	
	printf("Latitude:       %.06f\n", pvt_data->latitude);
	printf("Longitude:      %.06f\n", pvt_data->longitude);
	printf("Altitude:       %.01f m\n", pvt_data->altitude);
	printf("Accuracy:       %.01f m\n", pvt_data->accuracy);
	printf("Speed:          %.01f m/s\n", pvt_data->speed);
	printf("Speed accuracy: %.01f m/s\n", pvt_data->speed_accuracy);
	printf("Heading:        %.01f deg\n", pvt_data->heading);
	printf("Date:           %04u-%02u-%02u\n",
	       pvt_data->datetime.year,
	       pvt_data->datetime.month,
	       pvt_data->datetime.day);
	printf("Time (UTC):     %02u:%02u:%02u.%03u\n",
	       pvt_data->datetime.hour,
	       pvt_data->datetime.minute,
	       pvt_data->datetime.seconds,
	       pvt_data->datetime.ms);
	printf("PDOP:           %.01f\n", pvt_data->pdop);
	printf("HDOP:           %.01f\n", pvt_data->hdop);
	printf("VDOP:           %.01f\n", pvt_data->vdop);
	printf("TDOP:           %.01f\n", pvt_data->tdop);


		double last_latitude = pvt_data->latitude;
		double last_longitude = pvt_data->longitude;


	uint8_t x = 0, y = 32;
	char linex[128];



	for(int i=0;i<targets_count;i++){

		int heading, distance;

		calcul_cap_distance_int(last_latitude, last_longitude, targets[i*2], targets[i*2+1], &heading, &distance);


		//%6d DEG position 3 + %3d
		//%19d position 15 + %4d
		snprintf(linex, sizeof(linex), "%1d: %3d DEG  |  %4d m", i+1, heading, distance);

		for (const char *p = linex; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y);
		x += 6;

	}

		y+= 8;
		x = 0;
	}


	







}




#include <zephyr/net/socket.h>


#define HTTP_HOST "plongee.duckdns.org"
#define HTTP_PATH "/targets"
#define HTTP_PORT 8545
#define MAX_MTU_SIZE     2000
#define RECV_BUF_SIZE    2048
#define SEND_BUF_SIZE    MAX_MTU_SIZE

#define TEST_STRING "T"

//#define JSON_TEMPLATE "{\"Angle X\": %d\"Angle Y\": %d\"Angle Z\": %d}"
#define JSON_TEMPLATE "%ld,%.9f,%.9f"


#define JSON_TEMPLATE_LONG "%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f"

    char send_buf[2000];










int blocking_send(int fd, uint8_t *buf, uint32_t size, uint32_t flags)
{
    int err;

    do {
        err = send(fd, buf, size, flags);
    } while (err < 0 && (errno == EAGAIN));

    return err;
}

int blocking_connect(int fd, struct sockaddr *local_addr, socklen_t len)
{
    int err;

    do {
        err = connect(fd, local_addr, len);
		LOG_INF("ERROR CONNECT = %d", err);
    } while (err < 0 && errno == EAGAIN);

    return err;
}





void initial_connexion(){

	int err;

	lte_lc_connect();
		if (err) {
			LOG_ERR("Failed to connect to LTE network, error: %d", err);
			return err;
		}

		LOG_INF("Connected to LTE network");





	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};

    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


	if (err >= 0) {

    LOG_INF("Prepare send buffer:");

	
		uint8_t x = 0, y = 0;

		char line[128];
		snprintf(line,sizeof(line),"Connecting...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y);
			x += 6;

		}



	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, 0, 0, 0);



    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	char recv_buf[RECV_BUF_SIZE];
	int tot_num_bytes = 0;

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf, RECV_BUF_SIZE, 0);
		tot_num_bytes += num_bytes;
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);
		if (num_bytes < 0) {
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
		LOG_INF("%s\n", recv_buf);
	} while (num_bytes > 0);


    double values[10];                       // Tableau pour stocker les doubles
    size_t count = 0;


    char *token = strtok(recv_buf, ",");
    while (token != NULL && count < 10) {
        values[count] = strtod(token, NULL);  // Conversion vers double
        count++;
        token = strtok(NULL, ",");
    }

	targets_count = (count/2);



		x = 0;
		y = 8;

		snprintf(line, sizeof(line),"%d targets",targets_count);
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y);
			x += 6;

		}



    // Afficher les résultats
    for (size_t i = 0; i < targets_count*2; i++) {

		targets[i] = values[i];

        //printf("Valeur %zu = %f\n", i, values[i]);
    }


    LOG_INF("Finished. Closing socket");
    err = close(client_fd);

}

    freeaddrinfo(res);
	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);

}







int main(void)
{


//Démarre
//Va chercher ses coordonnées GPS
//Les stockent dans une structure
//Va se chercher un point GPS et tous ses satellites
//



