madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	//const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
	if (!device_is_ready(i2c_dev)) {
		LOG_ERR("I2C device not ready");
		return -ENODEV;
	}
	LOG_INF("I2C device is ready");

	clear_display(i2c_dev); // Efface l'écran avant de dessiner
    ssd1306_init(i2c_dev); // <-- Ajoute cette ligne ici

 


	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;







	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}


	lte_lc_init();
	lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,LTE_LC_SYSTEM_MODE_PREFER_LTEM);

	initial_connexion();


	/* DISPLAY THE 3 TARGETS
	uint8_t x = 0, y = 0;
	char linex[128];

	double initial_latitude = 45.57728199820725;
	double initial_longitude = -73.31914921587284;


	for(int i=0;i<targets_count;i++){

		int heading, distance;

		calcul_cap_distance_int(initial_latitude, initial_longitude, targets[i*2], targets[i*2+1], &heading, &distance);

		snprintf(linex, sizeof(linex), "%1d: %3d DEG  |  %4d m", i+1, heading, distance);

		for (const char *p = linex; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y);
		x += 6;

	}

		y+= 8;
		x = 0;
	}

	k_sleep(K_FOREVER);

	*/






/**

x = 0;
y = 0;

char *line = ">START GPS";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;

line = " START GPS + LTE";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;

line = "----------------------------";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}


y+=8;
x=0;

line = "LAST FIX: 1 min";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;
line = "1. 12   deg | 200   m";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;
line = "2. 250  deg | 200   m";
for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

	


**/














	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		return -1;
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	fix_timestamp = k_uptime_get();

	lte_lc_init();

	
	for (;;) {
		(void)k_poll(events, 2, K_FOREVER);

		if (events[0].state == K_POLL_STATE_SEM_AVAILABLE &&
		    k_sem_take(events[0].sem, K_NO_WAIT) == 0) {
			/* New PVT data available */

			if (IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)) {
				/* TTFF test mode. */

				/* Calculate the time GNSS has been blocked by LTE. */
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					time_blocked++;
				}
			} else if (IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY)) {
				/* NMEA-only output mode. */

				if (output_paused()) {
				//	goto handle_nmea;
				}

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					print_distance_from_reference(&last_pvt);
				}
			} else {
				/* PVT and NMEA output mode. */

				if (output_paused()) {
				//	goto handle_nmea;
				}

				//printf("\033[1;1H");
				//printf("\033[2J");
				print_satellite_stats(&last_pvt);

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					printf("GNSS operation blocked by LTE\n");
					//k_sleep(K_SECONDS(30));
				}
				if (last_pvt.flags &
				    NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME) {
					printf("Insufficient GNSS time windows\n");
						//k_sleep(K_SECONDS(30));

				}
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT) {
					printf("Sleep period(s) between PVT notifications\n");
				}
				printf("-----------------------------------\n");

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					fix_timestamp = k_uptime_get();
					print_fix_data(&last_pvt);
					print_distance_from_reference(&last_pvt);
				} else {
					printf("Seconds since last fix: %d\n",
					       (uint32_t)((k_uptime_get() - fix_timestamp) / 1000));
					cnt++;
					printf("Searching [%c]\n", update_indicator[cnt%4]);


				}

				printf("\nNMEA strings:\n\n");


				uint8_t x = 0, y = 0;

char line[128];






y=8;
x=0;
snprintf(line, sizeof(line), "Last fix: %d   ",
					       (uint32_t)((k_uptime_get() - fix_timestamp) / 1000));


for (const char *p = line; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}
			}
		}

handle_nmea:


	}






	
int k = 0;
	while (true) {
		k_sleep(K_SECONDS(1));

		
		

uint8_t x = 0, y = 0;

const char *line1 = "Acquisition: 1 min";
for (const char *p = line1; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;
const char *line2 = "1: 12  deg | 200  m";
for (const char *p = line2; *p; p++) {
    dessiner_caractere(i2c_dev, *p, x, y);
    x += 6;

}

y+=8;
x=0;
const char *line3 = "2: 60  deg | 20   m";
for (const char *p = line3; *p; p++) {
	dessiner_caractere(i2c_dev, *p, x, y);
	x += 6;

}



int cap, dist;
calcul_cap_distance_int(48.8566, 2.3522, 43.6045, 1.4442, &cap, &dist);
// cap et dist sont maintenant des entiers


y+=8;
x=0;
char line4[32];

snprintf(line4, sizeof(line4), "3: %d deg | %d m", cap, dist);

for (const char *p = line4; *p; p++) {
	dessiner_caractere(i2c_dev, *p, x, y);
	x += 6;

}











k_sleep(K_FOREVER); // Pause pour voir le résultat





	}
	{
		/* code */
	}
	

	return 0;
}
